In [1]:
from trading_algorithm_framework import portfolio as pf
from trading_algorithm_framework import stock

import pandas as pd
from datetime import datetime

In [2]:
aapl_data = pd.read_csv('C:/Users/jdbak/OneDrive/Documents/Stocks/individual_stocks_5yr/individual_stocks_5yr/AAPL_data.csv', index_col=0)
aapl_data.head()

               open     high      low    close     volume  Name
date
2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL

In [3]:
aapl_stock = stock.Stock('AAPL', aapl_data)

In [4]:
aapl_stock.history[datetime(2013, 2, 8)].high_price

68.4014

In [5]:
aapl_stock.history_df.head()

               open     high      low    close     volume  Name
date
2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL